# 15 Dec 2020 09:07

About org-latex-compile-with-template

** =org-latex-default-template-path=


#+begin_src emacs-lisp
(defun org-latex-default-template-path ()
  "Calculate full path of file to default template framework file.
  Concatenate org-latex-export-path with default path.
  Issue error if latex-export folder has not been installed."
  (let ((template-path (concat org-latex-export-path
                               "/templates/000BASIC/history/framework.tex")))
    (if (file-exists-p template-path)
        template-path
      (error "You must install latex-templates in your home folder to use this."))))

(org-latex-default-template-path)
#+end_src

#+RESULTS:
: /home/iani/latex-exports/templates/000BASIC/history/framework.tex

*** test: 

#+begin_src emacs-lisp
(org-latex-get-subtree-template-path)
#+end_src

#+RESULTS:
: /home/iani/latex-exports/templates/000BASIC/history/framework.tex

**** subtree template path

#+begin_src emacs-lisp
(org-latex-get-subtree-template-path)
#+end_src

#+RESULTS:
: /home/iani/latex-exports/templates/000BASIC/history/framework.tex


#+begin_src emacs-lisp

#+end_src

**** file template path

#+begin_src emacs-lisp
(org-latex-get-file-template-path)
#+end_src

#+RESULTS:
: /home/iani/latex-exports/templates/000BASIC/framework.tex

Example 2: Setting a custom framework for a subtree:

**** subtree with custom framework
     :PROPERTIES:
     :DATE:     <2020-12-19 Sat 15:30>
     :LATEX_HEADER_PATH: /home/iani/latex-exports/templates/000BASIC/history/00verysimple201210_201214.tex
     :END:

The custom framework path for this subtree was set interactively with function =org-latex-set-subtree-template-interactively=.  After that, the template path was tested like this:

#+begin_src emacs-lisp
(org-latex-get-subtree-template-path)
#+end_src

#+RESULTS:
: /home/iani/latex-exports/templates/000BASIC/history/00verysimple201210_201214.tex

** =org-latex-get-subtree-template-path=
   :PROPERTIES:
   :DATE:     <2020-12-19 Sat 18:18>
   :END:

#+begin_quote
"Get latex template file path from LATEX_HEADER_PATH property of current subtree."
#+end_quote

This is computed like this: 

#+begin_src emacs-lisp
(concat org-latex-export-path
                               "/templates/000BASIC/history/framework.tex")
#+end_src

#+RESULTS:
: /home/iani/latex-exports/templates/000BASIC/history/framework.tex

Above is the default value.

